> > The previous logic of only using the ID as the comparison key meant that changes to other attributes would not trigger an update to network interfaces.
> 
> Can you remind me what the configuration changes were the failed to trigger a call to `Update`? Was it creating a network interface as V4 and then trying to update it to V6 and vice versa?

The update was being trigger for the entire resource (the instance), but the previous `Update` logic had: 

```go
nicsToDelete := sliceDiffByID(
	state.NetworkInterfaces,
	plan.NetworkInterfaces,
	func(e instanceResourceNICModel) any {
		return e.ID.ValueString()
	},
)
// ...
nicsToCreate := sliceDiffByID(
	plan.NetworkInterfaces,
	state.NetworkInterfaces,
	func(e instanceResourceNICModel) any {
		return e.ID.ValueString()
	},
)
```

So if anything but the network interface ID changed, the provider would not modify the instance network interfaces. By using a hash of the non-computed attributes, we now detect changes to any user-provided value.

But this creates a new problem, which is that Terraform doesn't actually know the provider will re-create the network interfaces, so it was assuming that the non-computed attributes would updated in-place, and kept the computed attribute values the same. But after the apply, the network interface is fully re-created,  so the computed values change, and Terraform is unable to match the set element, because the plan said the computed values would stay the same.

By adding a plan modifier, we now tell Terraform that if the `ip_stack` is modified, the network interface will be re-created and so all of its computed attributes should be `<unknown>` during the plan.

Here's an example diff before the fix. Terraform will fail with a `produced an unexpected new value: .network_interfaces: planned set element` because the plan claims the new interface ID will stay the same:

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # oxide_instance.acc-instance-nic-352686a5-3a64-4dc2-a154-f0fc8fd9a09e will be updated in-place
  ~ resource "oxide_instance" "acc-instance-nic-352686a5-3a64-4dc2-a154-f0fc8fd9a09e" {
      ~ attached_network_interfaces = {
          - "acc-terraform-63511d0c-bd00-4d72-a5d0-b14eda5f3cac" = {
              - description   = "a sample nic" -> null
              - id            = "2e4fe728-6133-422c-9776-f1ddd96c8748" -> null
              - instance_id   = "d7d47bc2-1e74-4393-80e8-ba76c7821eae" -> null
              - ip_stack      = {
                  - v6 = {
                      - ip = "fdfd:a734:8d55::80" -> null
                    } -> null
                } -> null
              - mac_address   = "A8:40:25:F0:00:00" -> null
              - name          = "acc-terraform-63511d0c-bd00-4d72-a5d0-b14eda5f3cac" -> null
              - primary       = true -> null
              - subnet_id     = "64b226b7-0e5b-4b39-8ba8-63f1a1210569" -> null
              - time_created  = "2026-02-10 19:06:29.265348 +0000 UTC" -> null
              - time_modified = "2026-02-10 19:06:29.265348 +0000 UTC" -> null
              - vpc_id        = "c6f46633-8305-4e78-b7a9-c4affff61e81" -> null
            },
          - "acc-terraform-63511d0c-bd00-4d72-a5d0-b14eda5f3cac-2" = {
              - description   = "a second nic" -> null
              - id            = "ce27f961-c7ae-4e5d-ae9d-d136d30a209b" -> null
              - instance_id   = "d7d47bc2-1e74-4393-80e8-ba76c7821eae" -> null
              - ip_stack      = {
                  - v4 = {
                      - ip = "10.195.132.42" -> null
                    } -> null
                } -> null
              - mac_address   = "A8:40:25:F0:00:01" -> null
              - name          = "acc-terraform-63511d0c-bd00-4d72-a5d0-b14eda5f3cac-2" -> null
              - primary       = false -> null
              - subnet_id     = "08cbdcae-82f4-44fb-afb1-4745651a7d33" -> null
              - time_created  = "2026-02-10 19:06:29.487582 +0000 UTC" -> null
              - time_modified = "2026-02-10 19:06:29.487582 +0000 UTC" -> null
              - vpc_id        = "c6f46633-8305-4e78-b7a9-c4affff61e81" -> null
            },
        } -> (known after apply)
      ~ host_name                   = "terraform-acc-myhost" -> (known after apply)
        id                          = "d7d47bc2-1e74-4393-80e8-ba76c7821eae"
        name                        = "acc-terraform-0dfa79cd-26e0-4ec5-b5da-c30583390f93"
      ~ network_interfaces          = [
          - {
              - description   = "a sample nic" -> null
              - id            = "2e4fe728-6133-422c-9776-f1ddd96c8748" -> null
              - ip_config     = {
                  - v6 = {
                      - ip = "fdfd:a734:8d55::80" -> null
                    } -> null
                } -> null
              - mac_address   = "A8:40:25:F0:00:00" -> null
              - name          = "acc-terraform-63511d0c-bd00-4d72-a5d0-b14eda5f3cac" -> null
              - primary       = true -> null
              - subnet_id     = "64b226b7-0e5b-4b39-8ba8-63f1a1210569" -> null
              - time_created  = "2026-02-10 19:06:29.265348 +0000 UTC" -> null
              - time_modified = "2026-02-10 19:06:29.265348 +0000 UTC" -> null
              - vpc_id        = "c6f46633-8305-4e78-b7a9-c4affff61e81" -> null
                # (1 unchanged attribute hidden)
            },
          - {
              - description   = "a second nic" -> null
              - id            = "ce27f961-c7ae-4e5d-ae9d-d136d30a209b" -> null
              - ip_address    = "10.195.132.42" -> null
              - ip_config     = {
                  - v4 = {
                      - ip = "10.195.132.42" -> null
                    } -> null
                } -> null
              - mac_address   = "A8:40:25:F0:00:01" -> null
              - name          = "acc-terraform-63511d0c-bd00-4d72-a5d0-b14eda5f3cac-2" -> null
              - primary       = false -> null
              - subnet_id     = "08cbdcae-82f4-44fb-afb1-4745651a7d33" -> null
              - time_created  = "2026-02-10 19:06:29.487582 +0000 UTC" -> null
              - time_modified = "2026-02-10 19:06:29.487582 +0000 UTC" -> null
              - vpc_id        = "c6f46633-8305-4e78-b7a9-c4affff61e81" -> null
            },
          + {
              + description   = "a sample nic"
              + id            = "2e4fe728-6133-422c-9776-f1ddd96c8748"
              + ip_config     = {
                  + v4 = {
                      + ip = "auto"
                    }
                  + v6 = {
                      + ip = "fdfd:a734:8d55::80"
                    }
                }
              + mac_address   = "A8:40:25:F0:00:00"
              + name          = "acc-terraform-63511d0c-bd00-4d72-a5d0-b14eda5f3cac"
              + primary       = true
              + subnet_id     = "64b226b7-0e5b-4b39-8ba8-63f1a1210569"
              + time_created  = "2026-02-10 19:06:29.265348 +0000 UTC"
              + time_modified = "2026-02-10 19:06:29.265348 +0000 UTC"
              + vpc_id        = "c6f46633-8305-4e78-b7a9-c4affff61e81"
                # (1 unchanged attribute hidden)
            },
        ]
      ~ time_created                = "2026-02-10 19:06:21.420067 +0000 UTC" -> (known after apply)
      ~ time_modified               = "2026-02-10 19:06:29.587572 +0000 UTC" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

And here's the diff after the fix. Notice the `(known after apply)` values in the new network interface, which signals to Terraform that these values will change:

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # oxide_instance.acc-instance-nic-5b5d9a00-41a9-4d87-b674-4a6210d7e3ae will be updated in-place
  ~ resource "oxide_instance" "acc-instance-nic-5b5d9a00-41a9-4d87-b674-4a6210d7e3ae" {
      ~ attached_network_interfaces = {
          - "acc-terraform-9d08004c-d211-42a0-8803-3c2da58fa227" = {
              - description   = "a sample nic" -> null
              - id            = "38500020-fb04-4df6-a219-05d197c52892" -> null
              - instance_id   = "8a8cb6a0-2b69-48d4-930a-565b07019f80" -> null
              - ip_stack      = {
                  - v6 = {
                      - ip = "fdfd:a734:8d55::80" -> null
                    } -> null
                } -> null
              - mac_address   = "A8:40:25:F0:00:00" -> null
              - name          = "acc-terraform-9d08004c-d211-42a0-8803-3c2da58fa227" -> null
              - primary       = true -> null
              - subnet_id     = "64b226b7-0e5b-4b39-8ba8-63f1a1210569" -> null
              - time_created  = "2026-02-10 19:11:22.191753 +0000 UTC" -> null
              - time_modified = "2026-02-10 19:11:22.191753 +0000 UTC" -> null
              - vpc_id        = "c6f46633-8305-4e78-b7a9-c4affff61e81" -> null
            },
          - "acc-terraform-9d08004c-d211-42a0-8803-3c2da58fa227-2" = {
              - description   = "a second nic" -> null
              - id            = "4fc9a0e5-8293-470c-a555-713eb24cbf38" -> null
              - instance_id   = "8a8cb6a0-2b69-48d4-930a-565b07019f80" -> null
              - ip_stack      = {
                  - v4 = {
                      - ip = "10.130.197.42" -> null
                    } -> null
                } -> null
              - mac_address   = "A8:40:25:F0:00:01" -> null
              - name          = "acc-terraform-9d08004c-d211-42a0-8803-3c2da58fa227-2" -> null
              - primary       = false -> null
              - subnet_id     = "3f9fa676-5eba-47e5-aded-33b5ddc2768e" -> null
              - time_created  = "2026-02-10 19:11:22.425887 +0000 UTC" -> null
              - time_modified = "2026-02-10 19:11:22.425887 +0000 UTC" -> null
              - vpc_id        = "c6f46633-8305-4e78-b7a9-c4affff61e81" -> null
            },
        } -> (known after apply)
      ~ host_name                   = "terraform-acc-myhost" -> (known after apply)
        id                          = "8a8cb6a0-2b69-48d4-930a-565b07019f80"
        name                        = "acc-terraform-66d12ca6-4511-443a-9eb2-0a466075a60c"
      ~ network_interfaces          = [
          - {
              - description   = "a sample nic" -> null
              - id            = "38500020-fb04-4df6-a219-05d197c52892" -> null
              - ip_config     = {
                  - v6 = {
                      - ip = "fdfd:a734:8d55::80" -> null
                    } -> null
                } -> null
              - mac_address   = "A8:40:25:F0:00:00" -> null
              - name          = "acc-terraform-9d08004c-d211-42a0-8803-3c2da58fa227" -> null
              - primary       = true -> null
              - subnet_id     = "64b226b7-0e5b-4b39-8ba8-63f1a1210569" -> null
              - time_created  = "2026-02-10 19:11:22.191753 +0000 UTC" -> null
              - time_modified = "2026-02-10 19:11:22.191753 +0000 UTC" -> null
              - vpc_id        = "c6f46633-8305-4e78-b7a9-c4affff61e81" -> null
                # (1 unchanged attribute hidden)
            },
          - {
              - description   = "a second nic" -> null
              - id            = "4fc9a0e5-8293-470c-a555-713eb24cbf38" -> null
              - ip_address    = "10.130.197.42" -> null
              - ip_config     = {
                  - v4 = {
                      - ip = "10.130.197.42" -> null
                    } -> null
                } -> null
              - mac_address   = "A8:40:25:F0:00:01" -> null
              - name          = "acc-terraform-9d08004c-d211-42a0-8803-3c2da58fa227-2" -> null
              - primary       = false -> null
              - subnet_id     = "3f9fa676-5eba-47e5-aded-33b5ddc2768e" -> null
              - time_created  = "2026-02-10 19:11:22.425887 +0000 UTC" -> null
              - time_modified = "2026-02-10 19:11:22.425887 +0000 UTC" -> null
              - vpc_id        = "c6f46633-8305-4e78-b7a9-c4affff61e81" -> null
            },
          + {
              + description   = "a sample nic"
              + id            = (known after apply)
              + ip_address    = (known after apply)
              + ip_config     = {
                  + v4 = {
                      + ip = "auto"
                    }
                  + v6 = {
                      + ip = "fdfd:a734:8d55::80"
                    }
                }
              + mac_address   = "A8:40:25:F0:00:00"
              + name          = "acc-terraform-9d08004c-d211-42a0-8803-3c2da58fa227"
              + primary       = (known after apply)
              + subnet_id     = "64b226b7-0e5b-4b39-8ba8-63f1a1210569"
              + time_created  = (known after apply)
              + time_modified = (known after apply)
              + vpc_id        = "c6f46633-8305-4e78-b7a9-c4affff61e81"
            },
        ]
      ~ time_created                = "2026-02-10 19:11:14.218286 +0000 UTC" -> (known after apply)
      ~ time_modified               = "2026-02-10 19:11:22.523078 +0000 UTC" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

The sort of TL;DR is that the `instance` resource actually manages multiple resources, and so we need to do part of Terraform's work to detect changes to them.